app/controllers/markets_controller.rb

  def show
    market_selected = params[:market_id]
    @market = Market.find(market_selected)
---
SELECT "markets".* FROM "markets" WHERE "markets"."id" = $1 LIMIT 1  [["id", "1"]]