app/controllers/markets_controller.rb

SELECT "markets".* FROM "markets"
---
  def index
    unless user_signed_in?
      redirect_to '/users/sign_in'
    end
    @markets = Market.all

SELECT COUNT(*) FROM "startups" WHERE "startups"."market_id" = 1
SELECT "startups".* FROM "startups" WHERE "startups"."market_id" = 1
---
  def show
    @markets = Market.all
    @market_selected = params[:market_id]
    # @market = Market.find(@market_selected).startups.order("follower_count DESC")
    @market = Market.find(@market_selected).startups.order("follower_count DESC").paginate(:page => params[:page], :per_page => 8)
    @starts = Startup.all