app/controllers/startup_users_controller.rb

  def create


    startup = Startup.find(params[:id].to_i)


    StartupUser.create(user: current_user, startup: startup)
---
SELECT "startups".* FROM "startups" WHERE "startups"."id" = $1 LIMIT 1  [["id", 201]]
INSERT INTO "startup_users" ("created_at", "startup_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Wed, 15 Jan 2014 00:09:57 UTC +00:00], ["startup_id", 201], ["updated_at", Wed, 15 Jan 2014 00:09:57 UTC +00:00], ["user_id", 1]]