app/controllers/startups_controller.rb

SELECT "startups".* FROM "startups" WHERE "startups"."id" = $1 LIMIT 1  [["id", 0]]
---
  def show
    startup_id = params[:id].to_i
    @startup = Startup.find(startup_id)