app/views/markets/show.html.erb

SELECT "startups".* FROM "startups" WHERE "startups"."market_id" = 1
SELECT COUNT(*) FROM "startups" WHERE "startups"."market_id" = 1
---
<h1><%= @market.name %></h1>
<% @market.startups.size.times do |i| %>